package models

// Создание словаря для двух языков
var Phrases = map[string]map[string]string{
	"ru": {
		"ask_gender": "👤 <b>Шаг 2 из 8: Ваш пол</b>\nВыберите для точности расчёта калорий:",
		"btn_male":   "👨 Мужской",
		"btn_female": "👩 Женский",

		"ask_age": "🎂 <b>Шаг 3 из 8: Возраст</b>\nСколько вам полных лет? (Напишите числом)",

		"ask_weight": "⚖️ <b>Шаг 4 из 8: Вес</b>\nВведите ваш текущий вес в килограммах:",

		"ask_height": "📏 <b>Шаг 5 из 8: Рост</b>\nВведите ваш рост в сантиметрах (например, 175):",

		"ask_activity": "🏃 <b>Шаг 6 из 8: Интенсивность нагрузок</b>\nВыберите ваш уровень активности:",
		"btn_light":    "🟢 Легкие нагрузки",
		"btn_moderate": "🟡 Умеренные нагрузки",
		"btn_heavy":    "🔴 Сильные нагрузки",

		"ask_goals": "🎯 <b>Шаг 7 из 8: Ваша цель</b>\nЧего мы хотим достичь?",
		"btn_lose":  "📉 Сбросить вес",
		"btn_keep":  "⚖️ Поддержка массы",
		"btn_gain":  "📈 Набрать массу",
	},
	"kz": {
		"ask_gender": "👤 <b>8-ден 2-қадам: Жынысыңыз</b>\nКалорияны дәл есептеу үшін таңдаңыз:",
		"btn_male":   "👨 Ер адам",
		"btn_female": "👩 Әйел адам",

		"ask_age": "🎂 <b>8-ден 3-қадам: Жасыңыз</b>\nТолық жасыңыз қаншада? (Санмен жазыңыз)",

		"ask_weight": "⚖️ <b>8-ден 4-қадам: Салмақ</b>\nҚазіргі салмағыңызды килограмммен енгізіңіз:",

		"ask_height": "📏 <b>8-ден 5-қадам: Бойыңыз</b>\nБойыңызды сантиметрмен енгізіңіз (мысалы, 175):",

		"ask_activity": "🏃 <b>8-ден 6-қадам: Жаттығу қарқындылығы</b>\nБелсенділік деңгейін таңдаңыз:",
		"btn_light":    "🟢 Жеңіл жаттығулар",
		"btn_moderate": "🟡 Орташа жаттығулар",
		"btn_heavy":    "🔴 Ауыр жаттығулар",

		"ask_goals": "🎯 <b>8-ден 7-қадам: Мақсатыңыз</b>\nНеге қол жеткізгіңіз келеді?",
		"btn_lose":  "📉 Салмақ тастау",
		"btn_keep":  "⚖️ Салмақты сақтау",
		"btn_gain":  "📈 Салмақ қосу",
	},
}
