-- SQLite
DELETE FROM ingredients;

INSERT INTO ingredients (name_ru, name_kz, calories, proteins, fats, carbs) VALUES
-- Углеводы (Крупы, Хлеб)
('Овсяные хлопья', 'Сұлы жармасы', 366, 11.9, 7.2, 69.3),
('Гречневая крупа', 'Қарақұмық жармасы', 330, 12.6, 3.3, 64.2),
('Рис белый', 'Ақ күріш', 344, 6.7, 0.7, 78.9),
('Макароны', 'Макарон', 344, 10.4, 1.1, 71.5),
('Картофель', 'Картоп', 77, 2.0, 0.4, 16.3),
('Перловая крупа', 'Арпа жармасы', 320, 9.3, 1.1, 66.9),
('Хлеб цельнозерновой', 'Тұтас дәнді нан', 247, 8.0, 2.0, 43.0),

-- Белки
('Куриное филе', 'Тауық филесі', 113, 23.6, 1.9, 0.4),
('Говядина (вырезка)', 'Сиыр еті', 218, 19.0, 15.0, 0.0),
('Минтай (рыба)', 'Минтай (балық)', 72, 15.9, 0.9, 0.0),
('Креветки', 'Асшаяндар', 95, 20.0, 1.0, 0.0),
('Печень куриная', 'Тауық бауыры', 137, 20.4, 5.9, 0.7),
('Яйцо куриное', 'Тауық жұмыртқасы', 157, 12.7, 10.9, 0.7),
('Яйцо перепелиное', 'Бөдене жұмыртқасы', 168, 13.0, 13.0, 0.6),

-- Молочка и сыры
('Творог 5%', 'Сүзбе 5%', 121, 17.2, 5.0, 1.8),
('Кефир 2.5%', 'Айран 2.5%', 50, 2.9, 2.5, 3.9),
('Молоко 2.5%', 'Сүт 2.5%', 52, 2.8, 2.5, 4.7),
('Сыр Чеддер', 'Чеддер ірімшігі', 402, 25.0, 33.0, 1.3),

-- Бобовые
('Чечевица', 'Жасымық', 297, 24.0, 1.5, 46.0),
('Горох', 'Бұршақ', 298, 20.5, 2.0, 49.0),

-- Овощи, Фрукты, Жиры
('Капуста', 'Қырыққабат', 27, 1.8, 0.1, 4.7),
('Морковь', 'Сәбіз', 35, 1.3, 0.1, 6.9),
('Свекла', 'Қызылша', 43, 1.5, 0.1, 8.8),
('Огурец', 'Қияр', 15, 0.8, 0.1, 2.8),
('Яблоко', 'Алма', 52, 0.4, 0.4, 9.8),
('Банан', 'Банан', 95, 1.5, 0.2, 21.8),
('Авокадо', 'Авокадо', 160, 2.0, 14.7, 1.8),
('Оливковое масло', 'Зәйтүн майы', 898, 0.0, 99.8, 0.0),
('Грецкий орех', 'Жаңғақ', 654, 15.2, 65.2, 7.0);