-- SQLite
INSERT INTO recipe_ingredients (recipe_id, ingredient_id, weight_g) VALUES
-- 1. Овсянка с бананом (Хлопья, Молоко, Банан, Сливочное масло)
(1, 1, 50), (1, 13, 200), (1, 20, 100), (1, 29, 10),

-- 2. Классический омлет (Яйца, Молоко, Сливочное масло)
(2, 10, 100), (2, 13, 50), (2, 29, 10),

-- 3. Творожный перекус (Творог, Яблоко, Орехи)
(3, 11, 150), (3, 19, 100), (3, 30, 20),

-- 4. Курица с гречкой (Филе, Гречка, Оливковое масло)
(4, 8, 100), (4, 2, 80), (4, 28, 10),

-- 5. Минтай с картофелем (Минтай, Картофель, Оливковое масло)
(5, 9, 150), (5, 5, 200), (5, 28, 15),

-- 6. Рис с овощами (Рис, Морковь, Капуста, Оливковое масло)
(6, 3, 80), (6, 18, 50), (6, 17, 100), (6, 28, 15),

-- 7. Макароны с яйцом (Макароны, Яйцо, Сливочное масло)
(7, 4, 100), (7, 10, 50), (7, 29, 10),

-- 8. Витаминный салат (Капуста, Морковь, Оливковое масло)
(8, 17, 200), (8, 18, 50), (8, 28, 20),

-- 9. Грудка с салатом (Филе, Капуста, Оливковое масло)
(9, 8, 150), (9, 17, 150), (9, 28, 15),

-- 10. Овсяное печенье (Хлопья, Банан, Орехи)
(10, 1, 100), (10, 20, 100), (10, 30, 20),

-- 11. Чечевичный суп (Чечевица, Морковь, Оливковое масло)
(11, 15, 80), (11, 18, 50), (11, 28, 15),

-- 12. Перловка с курицей (Перловка, Филе, Оливковое масло)
(12, 6, 80), (12, 8, 150), (12, 28, 10),

-- 13. Печень куриная с рисом (Печень, Рис, Сливочное масло)
(13, 14, 150), (13, 3, 80), (13, 29, 15),

-- 14. Салат из свеклы (Свекла, Оливковое масло)
(14, 22, 200), (14, 28, 20),

-- 15. Кефир с яблоком (Кефир, Яблоко, Орехи)
(15, 12, 250), (15, 19, 100), (15, 30, 15),

-- 16. Картофельное пюре с рыбой (Картофель, Минтай, Сливочное масло)
(16, 5, 200), (16, 9, 150), (16, 29, 15),

-- 17. Гороховая каша (Горох, Сливочное масло)
(17, 16, 100), (17, 29, 15),

-- 18. Бутерброд с яйцом (Хлеб, Яйцо, Огурец, Сыр)
(18, 7, 50), (18, 10, 50), (18, 21, 50), (18, 31, 20),

-- 19. Гречка с кефиром (Гречка, Кефир, Орехи)
(19, 2, 80), (19, 12, 200), (19, 30, 15),

-- 20. Макароны с грудкой (Макароны, Филе, Оливковое масло)
(20, 4, 100), (20, 8, 100), (20, 28, 10);